docs/posts/2016-10-20-the-uselessness-of-political-factchecking.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 08, 2025 05:12 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Uselessness of Political Fact-Checking</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Uselessness of Political Fact-Checking</h1>
<p class="subtitle" role="doc-subtitle">Oct 20, 2016 00:00</p>
</header><p>
I&rsquo;ve decided that political fact-checking is largely useless. Either people completely ignore the work of fact-checkers, or the fact-checkers ignore the relevant facts. Today, I saw a claim that Clinton had leaked classified information about the nuclear response window. What was curious was that the post included a link to a <a href="http://www.snopes.com/clinton-four-minute-nuclear/">snopes.com</a> story explaining that the supposed leak was not classified, but was already public information. The person evidently failed to read the very story to which they had linked.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
Now, I&rsquo;m seeing many claims that only 5.7% of Clinton Foundation donations go to charity.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> Unlike the claim about the classified leak, this is at least partly true. That is indeed the percentage that is given by the Foundation to other organizations that do charitable work. What it ignores is that most of the money is kept by the Foundation for the charitable work that it does directly. The Foundation spends 12% on overhead costs, compared to the average charity which spends nearly 37%<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>. This earns the Clinton Foundation an &ldquo;A&rdquo; rating by the American Institute of Philanthropy&rsquo;s <a href="https://www.charitywatch.org/ratings-and-metrics/bill-hillary-chelsea-clinton-foundation/478">Charity Watch</a>. That doesn&rsquo;t mean that Clinton&rsquo;s claim that 90% of the Foundation&rsquo;s money goes to charitable causes and work is true, though. According to Charity Watch, it&rsquo;s only 88%. I suppose one could criticize Clinton for rounding up from 88% to 90%. That strikes me as a bit petty, but at least it would be true.
</p>

<div class="tagline" id="orgdcde031">
<p>
Tagged: <a href="../tags/politics.html">Politics</a> <a href="../tags/critical-thinking.html">Critical-Thinking</a>
</p>

</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
It is more than a bit ironic that the writers of the many stories expressing shock and outrage over Clinton&rsquo;s broadcast of the response time are broadcasting the time themselves. 
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
The first six pages of results from a Google search of &ldquo;Clinton 5.7%&rdquo; were entirely about this.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="http://www.thenonprofittimes.com/news-articles/survey-charities-should-spend-23-on-overhead/">The NonProfit Times</a>.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 08, 2025 05:12.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
